'''----------------------------------------------------------------------------------------------------------------------'''
'''----------------------------------------------------------------------------------------------------------------------'''
# Логические Выражения. Таск 8
# x = int(input("Введите число 1: "))
# y = int(input("Введите число 2: "))
# if x % y == 0:
#     print("x делиться y")
#     print(f"Частное {x // y}")
# else:
#     print("x не делиться на y")
#     print(f"Частное {x // y}")
#     print(f"Остаток {x % y}")
'''----------------------------------------------------------------------------------------------------------------------'''
'''----------------------------------------------------------------------------------------------------------------------'''
# Тип данных- множества, кортежи. Цикл while. Таск 13

# robert = {5, 7, 11, 10, 28} 
# kail = {1, 5, 14, 8, 22} 
# merri = {19, 20, 3, 11, 10}

# is_kail_find = False
# is_merri_find = False
# for x in robert:
#     # print(x)
#     for kails_num in kail:
#     #     print(kails_num)
#     # print("!!!!!!!!!!!!!!!!!!!!!!!")
#         if x == kails_num:
#             print("sovpalo")
#             is_kail_find = True
#     for merris_num in merri:
#         if x == merris_num:
#             is_merri_find = True
# # if is_kail_find:                               (П)
# #     print("Кайил нашел одно число роберта")    (Р)
# # else:                                          (О)
# #     print("Каил не нашел")                     (В)
# # if is_merri_find:                              (Е)
# #     print("мерри нашла число роберта")         (Р)
# # else:                                          (К)
# #     print("мерри не нашла")                    (А)
# if is_merri_find and is_kail_find:
#     print("kail merri")
# elif is_kail_find:
#     print("kail")
# elif is_merri_find:
#     print("merri")
# else:
#     print("no one")
'''----------------------------------------------------------------------------------------------------------------------'''
'''----------------------------------------------------------------------------------------------------------------------'''
# nums = [1,2,3,4,5]
# target = 2
# if target in nums:
#     print("Да")
# else:
#     print("Нет")
'''----------------------------------------------------------------------------------------------------------------------'''
'''----------------------------------------------------------------------------------------------------------------------'''
# Типы данных. Списки. Цикл for. Таск 35 (1 решение)
# chars = ['a', 'b', 'c', 'd', 'e', 'f', 'g']
# merge_from = input("")
# merge_to = input("")
# list1 = []
# a = chars.index(merge_from)
# b = chars.index(merge_to)+1
# res_= ""
# for x in chars[a:b]:
#     res_+= x
# list1.append(res_)
# for x in chars[b:]:
#     list1.append(x)
# print(list1)
# Типы данных. Списки. Цикл for. Таск 35 (1 решение)
# chars = ['a', 'b', 'c', 'd', 'e', 'f', 'g']
# merge_from = input("")
# merge_to = input("")
# first_index=chars.index(merge_from)
# second_index=chars.index(merge_to) + 1
# chars[first_index : second_index] = ["".join(chars[first_index:second_index])]
# print(chars)
'''----------------------------------------------------------------------------------------------------------------------'''
'''----------------------------------------------------------------------------------------------------------------------'''

# string = (7,2,3,4,5,6)
# string1 = list(string)

# print(string1)
'''----------------------------------------------------------------------------------------------------------------------'''
'''----------------------------------------------------------------------------------------------------------------------'''
# Типы данных. Списки. Цикл for. Таск 25
# list_ = ["sun', 'flowers', 'rumor', 'stranger', 'adventure', 'architect', 'accompany', 'abandon', 'cartoon"]
# a = input("")
# list1 = []
# for x in list_:
#     if x.startswith(a):
#         list1.append(x)
# print(list1)
'''----------------------------------------------------------------------------------------------------------------------'''
'''----------------------------------------------------------------------------------------------------------------------'''
# x = int(input(""))
# y = int(input(""))
# if x % y == 0:
#     print("x делиться на y")
#     print(f"Частное: ", x // y)
# else:
#     print("x не делиться на y")
#     print("Частное:", x // y)
#     print("Остаток", x % y) 
'''----------------------------------------------------------------------------------------------------------------------''''''----------------------------------------------------------------------------------------------------------------------'''
'''x = int(input())
y = int(input())
if x % y == 0:
    print(f"x делится на y'\n'Частное: ', {x // y}")
else:
    print(f"x не делится на y'\n'Частное:', {x // y}\n'Остаток', {x % y}")

    x = int(input())
y = int(input())
if x // y == 0:
    print("x делиться на y")
    print(f"Частное: ", x // y)
else:
    print("x не делиться на y")
    print("Частное:", x / y)
    print("Остаток", x % y) '''
'''----------------------------------------------------------------------------------------------------------------------'''
'''----------------------------------------------------------------------------------------------------------------------'''

# string = (1,2,3,4,5,6)
# string1 = string[0] + string[1] + string[2]
# string2 = string[3] + string[4] + string[5]
# if string1 == string2:
#     print("да")
# else:
#     print("нет")
'''----------------------------------------------------------------------------------------------------------------------'''
'''----------------------------------------------------------------------------------------------------------------------'''
# Логические Выражения. Таск 16
# a = int(input())
# b = int(input())
# c = int(input())
# if a <= b and a <= c and b <= c:
#     print(a,b,c)
# elif a <= c and a <= b and c <= b:
#     print(a,c,b)
# elif b <= a and b <= c and a <= c:
#     print(b,a,c)
# elif b <= c and b <= a and c <= a:
#     print(b,c,a)
# elif c <= a and c <= b and a <= b:
#     print(c,a,b)
# elif c <= b and c <= a and b <= a:
#     print(c,b,a)
# else:
#     print(a,b,c)
'''----------------------------------------------------------------------------------------------------------------------'''
'''----------------------------------------------------------------------------------------------------------------------'''
# num = int(input())
# num = range(1,12)
# if num[12] or num[1] or num[2]
#     print("зима")
# else:
#     print("Такого месяца нет")

# num = int(input())
# # num = range(1,13)
# # num = list(num)
# if num <= 2 or num == 12:
#     print("zima")
# else:
#     print("Такого месяца нет")

# num = int(input())
# # num = range(1,12)
# if num < 4:
#     print("зима")
# elif num > 3 and num < 6:
#     print("весна")
# elif num > 6 and num < 9:
#     print("лето")
# elif num > 9 and num <= 12:
#     print("dasd")

a = {'a': 1, 'b': 4, 'c': 1, 'd': 5, 'e': 6} 
b = {} 
for k, v in a.items(): 
    b.setdefault(k, 2)
    print(b)

